---
type: ZoneEquipmentData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 12
tags: [revit-api, class]
---

# ZoneEquipmentData

`Autodesk.Revit.DB.Mechanical.ZoneEquipmentData` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsDataCompleted | 2020.1 | `public bool IsDataCompleted ()` |
| Property | AirSystemId | 2020.1 | `public ElementId AirSystemId { get ; set ; }` |
| Property | ChilledWaterLoopId | 2020.1 | `public ElementId ChilledWaterLoopId { get ; set ; }` |
| Property | CondenserWaterLoopId | 2020.1 | `public ElementId CondenserWaterLoopId { get ; set ; }` |
| Property | CoolingCoilType | 2020.1 | `public AirCoolingCoilType CoolingCoilType { get ; set ; }` |
| Property | EquipmentBehavior | 2020.1 | `public ZoneEquipmentBehavior EquipmentBehavior { get ; set ; }` |
| Property | EquipmentType | 2020.1 | `public ZoneEquipmentHvacType EquipmentType { get ; set ; }` |
| Property | HeatingCoilType | 2020.1 | `public AirHeatingCoilType HeatingCoilType { get ; set ; }` |
| Property | HotWaterLoopId | 2020.1 | `public ElementId HotWaterLoopId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | VRFLoopId | 2020.1 | `public ElementId VRFLoopId { get ; set ; }` |